In [2]:
import pandas as pd
import numpy as np

In [ ]:
Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.
Ans :

In [3]:
a=pd.Series([4, 8, 15, 16, 23, 42])
print(a)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [ ]:
Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.
Ans :

In [4]:
elem_list=list(range(0,100,10))
elem_ser=pd.Series(elem_list)
print(elem_ser)

0     0
1    10
2    20
3    30
4    40
5    50
6    60
7    70
8    80
9    90
dtype: int64

In [ ]:
Q3. Create a Pandas DataFrame that contains the following data:
Ans :

In [5]:
pd.DataFrame({'Name':['Alice','Bob','Claire'],'Age':[25,30,27],'Gender':['Female','Male','Female']})

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [ ]:
Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
Ans :
    DataFrame is 2-Dimensional data structure consisting of rows and columns. It is similar to spreadsheet or relational database table. 
    Each column represents fields while each row represents records. DataFrame consist of heterogeneous Data Type.
    While Series is a 1-Dimensional labelled array. Series is a heterogeneous data type. Series act as building block for DataFrame making 
    its rows and columns.
    # ex. DataFrame:

In [6]:
df=pd.DataFrame({'Name':['Rajesh','Suresh','Ramesh','Lokesh','Naresh'],'Class':['XI','XII','XI','X','IX'],
                         'City':['Delhi','Hyderabad','Lucknow','Gajiabad','Satara']})
print(df)

     Name Class       City
0  Rajesh    XI      Delhi
1  Suresh   XII  Hyderabad
2  Ramesh    XI    Lucknow
3  Lokesh     X   Gajiabad
4  Naresh    IX     Satara

In [7]:
# ex. Series:
ser=pd.Series(['Zee','Sony','Sab TV','& TV','DD Channel'])
print(ser)

0           Zee
1          Sony
2        Sab TV
3          & TV
4    DD Channel
dtype: object

In [ ]:
Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?
Ans :
    pd.drop()-> use to delete column or row
    pd.dropna()-> use to remove missing values
    pd.fillna()-> use to fill NaN values with specific value
    pd.rename()-> use to rename column name
    pd.merge()-> use to join two different DataFrame

    ex.

In [8]:
df=pd.DataFrame({'Name':['Rajesh','Suresh','Ramesh','Lokesh','Naresh'],'Class':['XI','XII','XI','X','IX'],
                 'City':['Delhi','Hyderabad',np.nan,'Gajiabad','Satara']})
df.fillna(value="Other")

     Name Class       City
0  Rajesh    XI      Delhi
1  Suresh   XII  Hyderabad
2  Ramesh    XI      Other
3  Lokesh     X   Gajiabad
4  Naresh    IX     Satara

In [ ]:
Q6. Which of the following is mutable in nature Series, DataFrame, Panel?
Ans : All three data structures in pandas are mutable (i.e., data mutable and size mutable) except Series are
      only data mutable not size mutable.
    
    Series : One dimensional labelled array. It consist of homogeneous data.
             it is Data mutable
             it is size immutable
    Pandas : 2-Dimensional data structure consisting of rows and columns. It consist of heterogenous data.
             Data mutable
             Size mutable
    Panel :  3-Dimensional data structure which consist of heterogenous data.
             Data mutable 
             Size mutable

In [ ]:
Q7. Create a DataFrame using multiple Series. Explain with an example.
Ans :
    In the following example we have created four different pandas series ser1,ser2,ser3,ser4 and then 
    combine it with pd.DataFrame and created new DataFrame df.

In [9]:
ser1=pd.Series(['Anastasia', 'Dima', 'Katherine', 'James', 'Emily'])
ser2=pd.Series([12.5, 9, 16.5, np.nan, 9, 20])
ser3=pd.Series(['XII','X','XI','IX','VII'])
ser4=pd.Series(['Australia','UK','Japan','Brazil','USA'])
df=pd.DataFrame({'Name':ser1,'Score':ser2,'Class':ser3,'Country':ser4})
print(df)

        Name  Score Class    Country
0  Anastasia   12.5   XII  Australia
1       Dima    9.0     X         UK
2  Katherine   16.5    XI      Japan
3      James    NaN    IX     Brazil
4      Emily    9.0   VII        USA
5        NaN   20.0   NaN        NaN